/* Button in Timer */
"Edit" = "ערוך";

/* Button in Timer */
"Pause" = "הפסק";

/* Button in Timer */
"Reset" = "שתחל";

/* Button in Timer */
"Start" = "התחל";

/* Initial title of timer */
"Timer" = "ספירה לאחור";

/* Status line in Timer */
"Total Time" = "זמן כולל";

